#Область Интерфейс

&НаКлиенте
Функция ПолучитьНастройкиНавигатора() Экспорт
	
	// Общая идея такая - если указан тип хранения - ХранилищеНастроек, то читаем из хранилища
	// если указан метод - ФайлНастроек, то пытаемся найти в каталоге по умолчанию
	// файлы настроек - отдельно файл для собственно настроек, отдельно файл для дополнения метаданных.
	
	// Не забыть добавить методы - ОчиститьВсеНастройки
	
	
КонецФункции

#КонецОбласти

#Область Форма

#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область Элементы
#КонецОбласти

#Область Таблицы

#Область ИмяТаблицы
#КонецОбласти

#КонецОбласти

#Область Команды
#КонецОбласти

#КонецОбласти

#Область Методы

#Область Подключаемые
#КонецОбласти

#КонецОбласти

#Область Типы
#КонецОбласти
