#Область Форма

#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Область Предусловия
	
	Если Не ЗначениеЗаполнено(Параметры.ИмяРегистра) Тогда
		ВызватьИсключение("Не указано имя регистра!");
	КонецЕсли;
	
	#КонецОбласти
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[Параметры.ИмяРегистра];
	
	#Область Контекст
	
	Если Ложь Тогда
		МетаданныеРегистра = Метаданные.РегистрыСведений.АналогиНоменклатуры;
	КонецЕсли;
	
	#КонецОбласти
	
	ЕстьОбщиеРеквизиты = Не (Параметры.ОбщиеРеквизиты = Неопределено);
	ЕстьИзмерения = Не (Параметры.Измерения = Неопределено);
	
	Периодический = Не (МетаданныеРегистра.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);
	ПоПозицииРегистратора = (МетаданныеРегистра.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.ПозицияРегистратора);
	РежимЗаписиРегистра = МетаданныеРегистра.РежимЗаписи;
	
	Если РежимЗаписиРегистра = "Независимый" Тогда
		
		МенеджерЗаписи = РегистрыСведений[Параметры.ИмяРегистра].СоздатьМенеджерЗаписи();
		
		Если ЕстьИзмерения Тогда
			Для каждого Измерение Из Параметры.Измерения Цикл
				МенеджерЗаписи[Измерение.Ключ] = Измерение.Значение;
			КонецЦикла;
		КонецЕсли;
		
		Если Периодический Тогда
			МенеджерЗаписи.Период = Параметры.Период;
		КонецЕсли;
		
		МенеджерЗаписи.Прочитать();
		
		Если Не МенеджерЗаписи.Выбран() Тогда
			ВызватьИсключение("Не удалось прочитать запись регистра сведений по переданным параметрам!");
		КонецЕсли;
		
		Если ЕстьИзмерения Тогда
			стр_Измерения = АтрибутыЗаписи.ПолучитьЭлементы().Добавить();
			стр_Измерения.Имя = "Измерения";
			Для каждого Измерение Из МетаданныеРегистра.Измерения Цикл
				стр_Атрибут = стр_Измерения.ПолучитьЭлементы().Добавить();
				стр_Атрибут.Имя = Измерение.Имя;
				стр_Атрибут.Значение = МенеджерЗаписи[Измерение.Имя];
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Элементы
#КонецОбласти

#Область Таблицы

#Область ИмяТаблицы
#КонецОбласти

#КонецОбласти

#Область Команды
#КонецОбласти

#КонецОбласти

#Область Методы

#КонецОбласти

#Область Типы
#КонецОбласти
